#+TITLE: [Diario delle lezioni] Informatica @ DSS 2019/2020 - (E-N)

Qui potete trovare  tutte le informazioni riguardo  il contenuto delle
lezioni,  ed il  relativo  materiale. Tenete  d'occhio questa  pagina.

* <2019-11-06 mer> Lezione 14 - Esercizi su liste

  Altri esercizi su liste e sequenze

  - esercizio: calcolo di massimo e minimo;
  - esercizio:  verificare  che  una  sequenza sia  ordinata  in  modo
    crescente;
  - funzioni =sum=, =min=, =max=.
    
  Poi vedremo l'uso di parametri opzionali per le funzioni

  - verifica  che un  segmento di  una sequenza  sia ordinata  in modo
    crescente.

#+BEGIN_SRC python :exports both :results output
def ordinata(seq,start=0,stop=None):
    start=max(0,start)
    if stop is None or stop > len(seq):
        stop=len(seq)
    for i in range(start,stop-1):
        if seq[i]>seq[i+1]:
            return False
    return True

print( ordinata([7,5,4,1,4,6,2]) )
print( ordinata([7,5,4,1,4,6,2],6) )
print( ordinata([7,5,4,1,4,6,2],3,6) )
#+END_SRC

#+RESULTS:
: False
: True
: True


  Rappresentazione Python di matrici come liste di  liste. Ad esempio
  una matrice 
\begin{bmatrix}
1 & 2 & 3 \\
4 & 5 & 6 \\
7 & 8 & 9 \\
10 & 11 & 12
\end{bmatrix}
  viene rappresentata in Python come la lista 

: [[1,2,3], [4,5,6], [7,8,9], [10,11,12]]  

  - creazione di una matrice con valori uguali;
  - calcolo della matrice trasposta.

#+BEGIN_SRC python :exports both :results output
import random
def matrixcreate(r,c,fillvalue=0):
    M=[]
    for i in range(r):
        M.append( [fillvalue]*c)
    return M

def matrixsize(A):
    return len(A),len(A[0])

def matrixtranspose(A):
    r,c = matrixsize(A)
    T   = matrixcreate(c,r)
    for i in range(c):
        for j in range(r):
            T[i][j] = A[j][i]
    return T

def matrixrandomfill(A):
    r,c = matrixsize(A)
    for i in range(r):
        for j in range(c):
            A[i][j] = random.randint(0,100)

A = matrixcreate(4,2)
matrixrandomfill(A)
B = matrixtranspose(A)
print(A)
print(B)
#+END_SRC

#+RESULTS:
: [[16, 92], [77, 52], [76, 34], [51, 42]]
: [[16, 77, 76, 51], [92, 52, 34, 42]]


  
  *Lavoro assegnato:* Leggere i paragrafi 3.9, 5.8, 5.9 e 5.10.

* <2019-10-24 gio> Lezione 11 - Stringhe e scrittura di moduli

  Vediamo come le stringhe  possano essere considerate delle sequenze,
  e come si  possa lavorare su di essere usando  l'indicizzazione e lo
  slicing.  Vediamo  anche  come utilizzare  alcuno  ``metodi''  delle
  stringhe. Poi discutiamo l'uso e  la gestione dei moduli python, per
  scrivere programmi su file multipli.
  
  Abbiamo introdotto il  ciclo =for= su caratteri di una  stringa e su
  sequenze di interi ottenute tramite la funzione =range=.
  
#+BEGIN_SRC python :exports both :results output
X = 'stringa di prova'

# Ciclo while
i = 0
while i < len(X):
    print(X[i], end='-')
    i += 1

print('')

# Ciclo For su indici
for t in range(len(X)):
    print(X[t], end='-')

print('')

# Ciclo For su caratteri
for c in X:
    print(c, end='-')
#+END_SRC

#+RESULTS:
: s-t-r-i-n-g-a- -d-i- -p-r-o-v-a-
: s-t-r-i-n-g-a- -d-i- -p-r-o-v-a-
: s-t-r-i-n-g-a- -d-i- -p-r-o-v-a-
  


  *Materiale didattico*

  Uso e scrittura di moduli: ([[file:docs/moduli-slides.pdf][schermo]]|[[file:docs/moduli-print.pdf][stampa]])
 
  *Lavoro  assegnato:*  ripetere   gli  esercizi  delle  esercitazioni
  inserendo del codice per la gestione dei parametri sbagliati, usando
  =TypeError= e =ValueError= dove appropriato.

* <2019-10-23 mer> Lezione 10 - Stack, frame e gestione errori

  Abbiamo visto come cercare le triple pitagoriche con cicli annidati.

#+BEGIN_SRC python :exports both :results output
N = 15

a = 1
while a <= N:
    b = a+1
    while b <= N:
        c = b+1
        while c <= N:
            if a**2 + b**2 == c**2:
                print(a,b,c)
            c += 1 
        b += 1
    a += 1
#+END_SRC

#+RESULTS:
: 3 4 5
: 5 12 13
: 6 8 10
: 9 12 15

  
  Vediamo degli esempi tramite Thonny, e in particolare come evolve lo
  /stack/ delle chiamate a funzione. In questo contesto discutiamo

  Visibilità delle variabili
#+BEGIN_SRC python :exports code :results output
# Questa funzione ridefinisce x
def prova():
    x = 6       # x interna, che
                # nasconde eventuali x
                # esterne
    print(x)

x = 10          # x esterna
prova()    
print(x)        # x esterna è immutata
#+END_SRC

  Chiamate di funzioni  annidate e frame di  esecuzione (paragrafo 3.9
  del libro)
#+BEGIN_SRC python :exports code :results output
def livello_esterno(x):
    print("Entro nel livello esterno col valore ",x)
    livello_medio(21)
    print("Esco dal livello esterno col valore",x)

def livello_medio(y):
    print("Entro nel livello medio col valore ",y)
    livello_interno('aaa')
    print("Esco dal livello medio col valore",y)

def livello_interno(z):
    print("Entro nel livello interno col valore ",z)
    print("Esco dal livello interno col valore",z)

    
print("Corpo principale del programma")
livello_esterno(1.2)
print("fine")
#+END_SRC


  Vediamo anche  come sollevare  errori, simili  a quelli  che solleva
  Python in certe condizioni.

  *Materiale didattico*

  Gestione degli errori: ([[file:docs/gestionerrori-slides.pdf][schermo]]|[[file:docs/gestionerrori-print.pdf][stampa]])
 
  *Lavoro  assegnato:* leggere il Capitolo 8.

* <2019-10-09 mer> Lezione 6 - Esercizi sulle funzioni

  Abbiamo  visto  come  scrivere  una funzione  passo  passo,  e  come
  perfezionarla   e  inserirla   nel   contensto   di  un   programma.
  Abbiamo  anche visto  come  inserire una  stringa di  documentazione
  nella  funzione.  In  questo  contesto  abbiamo  visto  le  stringhe
  multilinea (ovvero quelle aperte e chiuse da tre apici o virgolette).

  Insieme abbiamo scritto il programma:

#+BEGIN_SRC python :exports both :results output
def hello(nome,età):
    """Produce un saluto personalizzato
    
    Questa funzione produce un saluto di presentazione
    che include le informazioni di `nome` ed `età`.
    """
    coda = " anni."
    if età == 1:
        coda = " anno."
    return "Ciao, sono "+nome+". Ho "+str(età)+coda

def stampa_incorniciato(testo):
    lunghezza = len(testo) 
    cornice = '*' * (lunghezza + 4) 
    print(cornice)
    print("* "+testo+' *')
    print(cornice)

stampa_incorniciato(hello('Marcello',23))
stampa_incorniciato("Testo arbitrario.")
stampa_incorniciato(hello('Giulia',1))
#+END_SRC

#+RESULTS:
: ************************************
: * Ciao, sono Marcello. Ho 23 anni. *
: ************************************
: *********************
: * Testo arbitrario. *
: *********************
: *********************************
: * Ciao, sono Giulia. Ho 1 anno. *
: *********************************
  

  *Lavoro assegnato:* rivedere gli esercizi della scorsa esercitazione
  e  provare   a  completarla.   *Mi  raccomando*  di   completare  il
  questionario finale.

